{
  "backend/main.mo": "Motoko actor storing leads in a map and exposing functions to add a lead and query one or all.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles and custom OKLCH color variables for light/dark themes.",
  "frontend/index.html": "Main HTML entry point loading fonts, meta tags, and mounting the root React app.",
  "frontend/src/App.tsx": "Top‑level React component handling routing between the homepage and the Control Framework page.",
  "frontend/src/components/Footer.tsx": "Footer component showing copyright info and a caffeine.ai attribution link.",
  "frontend/src/components/forms/ControlLeadGenForm.tsx": "Lead‑generation form with validation, dropdowns, submission handling, and success state rendering.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact section with email, phone, location, and a button to book a strategy call.",
  "frontend/src/components/sections/ControlFrameworkSection.tsx": "Displays the CONTROL framework steps with images and descriptions plus a read‑more navigation handler.",
  "frontend/src/components/sections/EmotionalBlockSection.tsx": "Presents messaging about founder dependency and business fragility if the founder steps away.",
  "frontend/src/components/sections/FinalCtaSection.tsx": "Shows a final call‑to‑action with text and a button that scrolls to the contact section.",
  "frontend/src/components/sections/HeroSection.tsx": "Provides the hero banner with headline text and buttons scrolling to contact or framework sections.",
  "frontend/src/components/sections/IndustriesSection.tsx": "Lists target industries with icons and descriptions over a decorative background.",
  "frontend/src/components/sections/InsightsSection.tsx": "Displays a grid of insight cards with titles, excerpts, and categories.",
  "frontend/src/components/sections/OutcomesSection.tsx": "Shows key business outcomes and an accompanying dashboard image.",
  "frontend/src/components/sections/ProblemSection.tsx": "Lists common business problems and highlights systems issues as the root cause.",
  "frontend/src/components/sections/ProcessSection.tsx": "Renders a four-step process section with visuals and styled cards describing Inovics’ workflow. Uses static step data and maps it into a responsive layout.",
  "frontend/src/components/sections/WhatInovicsDoesSection.tsx": "Displays three feature cards showing Control, Clarity, and Continuity with icons and descriptions. Introduces Inovics’ business operating system concept.",
  "frontend/src/components/TopNav.tsx": "Navigation bar with scroll‑spy, hash‑based homepage navigation, and routing to the Control Framework page.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on the user’s Internet Identity using React Query. Automatically refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, identity loading, and state management. Wraps AuthClient creation and exposes login, logout, and status flags.",
  "frontend/src/hooks/useLeadSubmission.ts": "Submits lead data to the backend actor’s addLead method with loading, success, and error state handling. Depends on useActor for backend connectivity.",
  "frontend/src/index.css": "Defines Tailwind base styles, INOVICS color variables, dark mode settings, and utility classes. Sets global visual rules including scrolling, borders, and reduced‑motion behavior.",
  "frontend/src/lib/strategyCall.ts": "Triggers a mailto link that opens an email prefilled for requesting a strategy call.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and loads global styles.",
  "frontend/src/pages/ControlFrameworkPage.tsx": "Implements the CONTROL framework page with hero content, detailed framework steps, and a call‑to‑action button. Uses structured data to render each framework stage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom INOVICS colors, typography, animations, and container settings. Extends theme values and registers plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing project state for adding a CONTROL Framework landing page, navigation updates, and a lead‑gen form with required fields and behaviors."
}