{
  "backend/main.mo": "Motoko actor storing leads in a Map with add, get, and list query methods.",
  "feature_evidence.json": "Feature evidence report listing hero slider features, related files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Text file containing short summaries of all frontend components, pages, hooks, and config files.",
  "frontend/index.css": "Global Tailwind-based CSS defining color variables, dark mode tokens, and base styling.",
  "frontend/index.html": "HTML entry point setting metadata, loading Inter font, and mounting the React app.",
  "frontend/src/App.tsx": "Main React component handling client-side routing and rendering either standalone pages or the homepage sections.",
  "frontend/src/components/contact/CompanyProfileDownloadDialog.tsx": "Modal dialog that collects basic company details, validates input, submits a lead, and triggers a company profile download on success.",
  "frontend/src/components/contact/ContactOptionsGrid.tsx": "Grid of contact options including strategy call booking, company profile download dialog, email link, and WhatsApp link handling.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright, attribution link, and dynamic year with branding.",
  "frontend/src/components/forms/ControlLeadGenForm.tsx": "Lead generation form collecting company and challenge details, validating input, and submitting a lead with a success confirmation view.",
  "frontend/src/components/forms/FounderControlBlueprintInquiryForm.tsx": "Inquiry form for the Founder Control Blueprint collecting company, operational, and contact details with validation and lead submission.",
  "frontend/src/components/forms/IndustriesLeadGenForm.tsx": "Industry-specific lead generation form requesting company details and bottlenecks, validating inputs, and submitting a lead with a thank-you state.",
  "frontend/src/components/forms/InsightsNewsletterForm.tsx": "Newsletter subscription form with validation, lead submission, and success state handling.",
  "frontend/src/components/forms/ProcessLeadGenForm.tsx": "Lead generation form collecting company, industry, revenue, and challenge details with validation and submission.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section displaying email, phone, location, and a button to schedule a strategy call.",
  "frontend/src/components/sections/ControlFrameworkSection.tsx": "Section explaining the CONTROL framework with a scrollable set of steps and images, plus navigation handling.",
  "frontend/src/components/sections/EmotionalBlockSection.tsx": "Section highlighting founder dependency issues and the need for system-driven operations.",
  "frontend/src/components/sections/FinalCtaSection.tsx": "Final call-to-action prompting users to book a strategy call.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with a themed background and the main slider component.",
  "frontend/src/components/sections/HeroSlider.tsx": "Interactive hero slider with autoplay, drag support, and multiple CTA-driven slides.",
  "frontend/src/components/sections/IndustriesSection.tsx": "Renders a grid of industry cards highlighting four target business categories with icons, titles, and descriptions, along with a styled background image.",
  "frontend/src/components/sections/InsightsSection.tsx": "Displays a three‑card insights grid with titles, excerpts, categories, and a hoverable call‑to‑action, including a decorative header image.",
  "frontend/src/components/sections/OutcomesSection.tsx": "Shows a list of operational outcomes with check icons and an accompanying dashboard mockup image.",
  "frontend/src/components/sections/ProblemSection.tsx": "Lists five common business problems with icons and ends with a highlighted statement about systems issues.",
  "frontend/src/components/sections/ProcessSection.tsx": "Presents a four‑step transformation process with numbered cards and a background visual.",
  "frontend/src/components/sections/WhatInovicsDoesSection.tsx": "Displays three feature cards—Control, Clarity, Continuity—with icons and brief descriptions.",
  "frontend/src/components/TopNav.tsx": "Responsive navigation bar with hash scrolling, client-side routing, mobile sheet menu, and strategy-call CTA.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including loading, login, logout, and status handling.",
  "frontend/src/hooks/useLeadSubmission.ts": "Submits lead data through the backend actor and exposes loading, success, and error states.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Returns whether the user’s system prefers reduced motion by tracking a media query.",
  "frontend/src/index.css": "Sets Tailwind layers and defines custom CSS variables for light/dark mode with brand colors and utility classes.",
  "frontend/src/lib/contactConfig.ts": "Exports configurable URLs for calendar booking, WhatsApp, and company profile links.",
  "frontend/src/lib/strategyCall.ts": "Opens the configured calendar URL or falls back to a mailto link for strategy call booking.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with hero section, contact options, inquiry form, and qualification details.",
  "frontend/src/pages/ControlFrameworkPage.tsx": "Displays the CONTROL framework overview with details for each step and a CTA to book a strategy call.",
  "frontend/src/pages/IndustriesPage.tsx": "Shows industry-focused content with hero section, business focus details, and lead generation interactions.",
  "frontend/src/pages/InsightsPage.tsx": "Presents insights categories, featured article previews, and a hero section for the insights portal.",
  "frontend/src/pages/ProcessPage.tsx": "React page rendering the multi-section Process overview with hero, philosophy content, and staged process layout using UI components.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, typography, container queries, and animations.",
  "project_state.json": "Project state file describing features, requirements, and planned updates for the homepage hero slider transformation."
}