{
  "backend/main.mo": "Actor implementing lead submission and RBAC-protected admin/user profile operations using AccessControl and in-memory maps.",
  "feature_evidence.json": "Feature evidence report linking an auto-rotating hero slider feature to its source file, components, and test ID.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all main frontend files and sections.",
  "frontend/index.css": "Global Tailwind setup defining OKLCH color tokens, dark mode variables, and base styling for background, borders, and text.",
  "frontend/index.html": "HTML entry point loading Inter fonts, defining SEO metadata, and mounting the React application.",
  "frontend/src/App.tsx": "Client-side router that switches between homepage sections or standalone pages and manages scroll behavior on navigation.",
  "frontend/src/components/contact/CompanyProfileDownloadDialog.tsx": "A dialog component for collecting basic user info, validating it, submitting a lead, and triggering a company profile download.",
  "frontend/src/components/contact/ContactOptionsGrid.tsx": "Displays a grid of contact options including scheduling a call, downloading a company profile, emailing, and WhatsApp contact.",
  "frontend/src/components/Footer.tsx": "Footer component showing copyright, a Caffeine.ai attribution link, and a dynamic year.",
  "frontend/src/components/forms/ControlLeadGenForm.tsx": "A lead-generation form that validates company and contact details, submits them, and shows a success message.",
  "frontend/src/components/forms/FounderControlBlueprintInquiryForm.tsx": "A detailed inquiry form for the Founder Control Blueprint, validating inputs and submitting lead data.",
  "frontend/src/components/forms/IndustriesLeadGenForm.tsx": "A lead-gen form for industry-specific requests, validating user inputs and submitting the collected information.",
  "frontend/src/components/forms/InsightsNewsletterForm.tsx": "Newsletter signup form with validation, lead submission, and success/reset states.",
  "frontend/src/components/forms/ProcessLeadGenForm.tsx": "Lead generation form collecting company, industry, revenue, and challenge details, submitting via useLeadSubmission.",
  "frontend/src/components/forms/StrategySessionApplicationForm.tsx": "Application form for strategy sessions capturing business details, bottlenecks, and systems before submitting a lead.",
  "frontend/src/components/industries/CaseStudyCard.tsx": "Card component that displays a case study title and opens its PDF or shows a placeholder.",
  "frontend/src/components/industries/industriesContent.ts": "Static content definitions for industries, including services, challenges, solutions, and case studies.",
  "frontend/src/components/industries/IndustryBlock.tsx": "Renders an industry section with challenges, solutions, major service tiles, and related case studies.",
  "frontend/src/components/industries/MajorServiceTile.tsx": "Displays a service tile with an image or placeholder and the service label.",
  "frontend/src/components/ScrollToTopControl.tsx": "Floating button that appears after scrolling and smooth-scrolls the user back to the top.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact section with email, phone, address, and a button to book a strategy call.",
  "frontend/src/components/sections/ControlFrameworkSection.tsx": "Displays the CONTROL framework steps with images in a scrollable grid and a link to read more.",
  "frontend/src/components/sections/EmotionalBlockSection.tsx": "Shows a dark-themed section describing founder dependency and the need for strategic systems.",
  "frontend/src/components/sections/FinalCtaSection.tsx": "Provides a final call-to-action encouraging users to book a strategy call.",
  "frontend/src/components/sections/HeroSection.tsx": "Defines the hero area with a background image and embeds the HeroSlider component.",
  "frontend/src/components/sections/HeroSlider.tsx": "Implements an interactive sliding hero banner with CTAs, navigation, and touch-drag support.",
  "frontend/src/components/sections/IndustriesSection.tsx": "Lists target industries with icon cards describing how the service benefits each sector.",
  "frontend/src/components/sections/InsightsSection.tsx": "Shows insight cards summarizing articles with categories and excerpts.",
  "frontend/src/components/sections/OutcomesSection.tsx": "Highlights key business outcomes and displays a dashboard mockup image.",
  "frontend/src/components/sections/PageHero.tsx": "Provides a reusable hero section with configurable title, subtitle, description, and background.",
  "frontend/src/components/sections/ProblemSection.tsx": "Displays a grid of common business problems with icons and a closing message about system issues.",
  "frontend/src/components/sections/ProcessSection.tsx": "Defines a multi-step process with accordion-based structured content and CTAs for each service stage.",
  "frontend/src/components/sections/WhatInovicsDoesSection.tsx": "Shows three core features—Control, Clarity, Continuity—with icons and descriptions.",
  "frontend/src/components/TopNav.tsx": "Sticky navigation bar with scroll-based active section tracking, mobile sheet menu, and custom client-side routing logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminLeads.ts": "Fetches all leads for admin users via the actor with caching and loading states.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the current caller is an admin using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, state management, and context for authentication across the app.",
  "frontend/src/hooks/useLeadSubmission.ts": "Handles lead submission to the backend with loading, success, and error states.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced-motion preference via a media query.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom design system with utilities, colors, and motion preferences.",
  "frontend/src/lib/contactConfig.ts": "Holds external contact configuration and static company contact details.",
  "frontend/src/lib/strategyCall.ts": "Navigates the user to the strategy-session page with smooth scrolling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page handling Internet Identity login and conditional fetching of admin status and leads, with various UI states for loading and errors.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with hero section, contact options, an inquiry form, qualification criteria, and hash‑based scrolling behavior.",
  "frontend/src/pages/ControlFrameworkPage.tsx": "Marketing page explaining the CONTROL™ framework, its stages, and includes a scroll-to-form CTA and lead generation form.",
  "frontend/src/pages/IndustriesPage.tsx": "Industries overview page showing served sectors, industry blocks, and common operational challenges with a strategy call CTA.",
  "frontend/src/pages/InsightsPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/ProcessPage.tsx": "Process overview page outlining philosophy and a structured 4‑stage transformation process with supporting sections and CTAs.",
  "frontend/src/pages/StrategySessionPage.tsx": "React page rendering a strategy session hero, eligibility sections, and a scroll-to-form handler.",
  "frontend/src/utils/urlParams.ts": "Utilities to read, store, persist, and clear URL or session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project metadata tracking state, features, and pending requests for auto-advancing a hero banner."
}