{
  "backend/main.mo": "Motoko canister storing leads in a map with add, get, and list query functions.",
  "feature_evidence.json": "Feature evidence report mapping two navigation-related features to affected frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend components, pages, and styles.",
  "frontend/index.css": "Global Tailwind and OKLCH variable definitions for theming, including dark mode overrides.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and the root React app container.",
  "frontend/src/App.tsx": "Root React component handling client-side routing and rendering homepage sections or standalone pages.",
  "frontend/src/components/contact/CompanyProfileDownloadDialog.tsx": "Dialog form for downloading the company profile, validating input and submitting a lead before triggering download.",
  "frontend/src/components/contact/ContactOptionsGrid.tsx": "Renders a grid of contact options including scheduling a call, downloading a company profile, sending an email, and WhatsApp messaging with dialog handling.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright, attribution, and a Caffeine.ai referral link.",
  "frontend/src/components/forms/ControlLeadGenForm.tsx": "A lead generation form collecting company and contact details with validation, submits data through useLeadSubmission, and shows a success screen.",
  "frontend/src/components/forms/FounderControlBlueprintInquiryForm.tsx": "Form for Founder Control Blueprint inquiries capturing business details and bottlenecks, validating fields, and submitting via useLeadSubmission with a success message.",
  "frontend/src/components/forms/IndustriesLeadGenForm.tsx": "Lead form for industry blueprint requests gathering business info and bottlenecks, performing validation, submitting via useLeadSubmission, and showing a confirmation.",
  "frontend/src/components/forms/InsightsNewsletterForm.tsx": "Newsletter subscription form validating basic user and company info, submitting via useLeadSubmission, and displaying a subscription confirmation.",
  "frontend/src/components/forms/ProcessLeadGenForm.tsx": "Form component collecting lead info for process inquiries with validation and submission via useLeadSubmission.",
  "frontend/src/components/forms/StrategySessionApplicationForm.tsx": "Form for strategy session applications including company details, bottlenecks, and system info, submitted through useLeadSubmission.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact details and a CTA button to schedule a strategy call.",
  "frontend/src/components/sections/ControlFrameworkSection.tsx": "Showcases the CONTROL framework steps with images and a read‑more navigation action.",
  "frontend/src/components/sections/EmotionalBlockSection.tsx": "Section highlighting founder dependency issues with persuasive messaging.",
  "frontend/src/components/sections/FinalCtaSection.tsx": "Final call‑to‑action section prompting users to book a strategy call.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section rendering a full‑screen background and the HeroSlider.",
  "frontend/src/components/sections/HeroSlider.tsx": "Interactive hero slider with swipe support, multiple slides, and CTAs linking to pages or triggering calls.",
  "frontend/src/components/sections/IndustriesSection.tsx": "Renders a section listing four target industries with icons, titles, and descriptions in card format.",
  "frontend/src/components/sections/InsightsSection.tsx": "Displays a grid of insight cards with category, title, excerpt, and a call‑to‑action link.",
  "frontend/src/components/sections/OutcomesSection.tsx": "Shows key business outcomes in a checklist layout alongside an illustrative dashboard image.",
  "frontend/src/components/sections/ProblemSection.tsx": "Presents common business problems as icon‑labeled items followed by a highlighted systems‑problem message.",
  "frontend/src/components/sections/ProcessSection.tsx": "Outlines a four‑step transformation process with numbered cards and descriptive text.",
  "frontend/src/components/sections/WhatInovicsDoesSection.tsx": "Introduces three core features—Control, Clarity, Continuity—with icons and descriptions.",
  "frontend/src/components/TopNav.tsx": "Responsive navigation bar with hash and route navigation, scroll tracking, and strategy call button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useLeadSubmission.ts": "Defines a lead submission handler that sends form data to the backend via the actor and manages UI state.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Returns whether the user prefers reduced motion using a media query listener.",
  "frontend/src/index.css": "Tailwind base file defining theme color variables, dark mode settings, and custom utilities for layout, visuals, and motion reduction.",
  "frontend/src/lib/contactConfig.ts": "Exports contact configuration placeholders and centralized contact email/phone constants.",
  "frontend/src/lib/strategyCall.ts": "Provides a helper that navigates to the strategy session page via client-side routing and scrolls to top.",
  "frontend/src/main.tsx": "Initializes React app root with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/ContactPage.tsx": "Implements the Contact page with hero section, contact options, an inquiry form, and qualification criteria.",
  "frontend/src/pages/ControlFrameworkPage.tsx": "Renders the CONTROL framework page with hero, explanation sections, and scroll-to lead gen functionality.",
  "frontend/src/pages/IndustriesPage.tsx": "Describes industries served, featuring hero, industry focus, and scroll-triggered lead generation sections.",
  "frontend/src/pages/InsightsPage.tsx": "Renders Insights page including hero visuals, categorized content topics, and featured article previews.",
  "frontend/src/pages/ProcessPage.tsx": "Renders a multi-section marketing page describing the company’s process, including a hero CTA and structured content blocks. Uses UI components and styling for layout and showcases the 4‑stage process.",
  "frontend/src/pages/StrategySessionPage.tsx": "Implements the Strategy Session application page with hero content, eligibility sections, and a scroll-to-form handler. Contains the form container and supporting UI components.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and brand-specific palette extensions. Defines theme extensions, plugins, and content paths.",
  "project_state.json": "Metadata describing project state, existing features, and new feature requests related to navigation and routing for the Strategy Session page."
}