{
  "backend/main.mo": "Motoko backend managing leads and user profiles with admin-protected access and bootstrap-based admin initialization.",
  "feature_evidence.json": "Feature evidence report listing two frontend image‑update features with related components, files, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their purpose and recent feature updates.",
  "frontend/index.css": "Global Tailwind and color‑variable definitions with dark mode tokens and base styling.",
  "frontend/index.html": "HTML entry point including SEO metadata, Inter font preload, dark mode class, and root mount point.",
  "frontend/src/App.tsx": "Main React app handling client‑side routing, insight article rendering, and scroll restoration.",
  "frontend/src/components/admin/AdminManagementCard.tsx": "UI card that validates a Principal ID and calls actor.grantAdminPrivileges, showing success or error states.",
  "frontend/src/components/admin/AdminTokenRestoreCard.tsx": "Form card for submitting a bootstrap token to initialize the first admin, handling success and common error cases.",
  "frontend/src/components/contact/CompanyProfileDownloadDialog.tsx": "Dialog that collects lead details, submits them, and triggers a company profile download on success.",
  "frontend/src/components/contact/ContactOptionsGrid.tsx": "Grid of contact actions including strategy call booking, profile download dialog, and email link.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright, attribution link, and current year.",
  "frontend/src/components/forms/ControlLeadGenForm.tsx": "Lead-generation form collecting company and challenge details, validating input, and submitting via useLeadSubmission.",
  "frontend/src/components/forms/FounderControlBlueprintInquiryForm.tsx": "Inquiry form for the Founder Control Blueprint, validating detailed business inputs and submitting via useLeadSubmission.",
  "frontend/src/components/forms/IndustriesLeadGenForm.tsx": "Lead-generation form collecting company, industry, revenue, bottleneck, and contact info with validation and submission via useLeadSubmission.",
  "frontend/src/components/forms/InsightsNewsletterForm.tsx": "Newsletter signup form capturing name, email, company, and revenue range with validation and submission handling.",
  "frontend/src/components/forms/ProcessLeadGenForm.tsx": "Process-focused lead form gathering company details and operational challenges, including retry logic for submission errors.",
  "frontend/src/components/forms/StrategySessionApplicationForm.tsx": "Application form for strategy sessions collecting detailed company data, systems info, and bottlenecks before submitting via useLeadSubmission.",
  "frontend/src/components/industries/CaseStudyCard.tsx": "UI card for case studies that opens PDFs or triggers detail views depending on props.",
  "frontend/src/components/industries/CaseStudyDetailsModal.tsx": "Modal displaying case study sections with smart list detection and formatted content.",
  "frontend/src/components/industries/industriesContent.ts": "Defines TypeScript interfaces and static content for industries, major services, challenges, solutions, and case studies. Provides structured data used across the industries UI.",
  "frontend/src/components/industries/IndustryBlock.tsx": "Renders an industry section with challenges, solutions, major service tiles, and case study cards. Limits displayed services to those with matching solutions.",
  "frontend/src/components/industries/MajorServiceTile.tsx": "Displays a single major service with an image or fallback placeholder and its label. Handles image load errors gracefully.",
  "frontend/src/components/ScrollToTopControl.tsx": "Scroll‑to‑top button appearing after scroll threshold and scrolling smoothly to top.",
  "frontend/src/components/sections/ContactSection.tsx": "Shows contact methods (email, phone, address) and a button to book a strategy call. Uses icons and responsive layout.",
  "frontend/src/components/sections/ControlFrameworkSection.tsx": "Displays the CONTROL framework steps with images in a scrollable or grid layout. Includes a handler to navigate to the full framework page.",
  "frontend/src/components/sections/EmotionalBlockSection.tsx": "Provides a dramatic messaging block highlighting founder dependency issues. Styled with dark themed backgrounds and centered text.",
  "frontend/src/components/sections/FinalCtaSection.tsx": "Presents a final call‑to‑action section encouraging users to book a strategy call. Includes headline, description, and CTA button.",
  "frontend/src/components/sections/HeroSection.tsx": "Wraps the hero slider in a styled full‑screen background section. Adds gradient and pattern layers behind the slider.",
  "frontend/src/components/sections/HeroSlider.tsx": "Implements an auto‑navigable, swipe‑supported hero slider with headlines and CTA actions. Manages slide state, transitions, and navigation helpers.",
  "frontend/src/components/sections/IndustriesSection.tsx": "Renders a grid of industry cards with icons, titles, and descriptions over a decorative background.",
  "frontend/src/components/sections/InsightsSection.tsx": "Displays three featured insight articles with click navigation and a button linking to all insights.",
  "frontend/src/components/sections/OutcomesSection.tsx": "Shows a list of business outcomes alongside a product mockup image.",
  "frontend/src/components/sections/PageHero.tsx": "Reusable hero section component with title, optional text, children, and a customizable background image.",
  "frontend/src/components/sections/ProblemSection.tsx": "Lists common business problems with icon cards and ends with a systems-focused message.",
  "frontend/src/components/sections/ProcessSection.tsx": "Accordion-based walkthrough of four implementation steps, each with descriptions and bullet-point details.",
  "frontend/src/components/sections/TechStackSection.tsx": "Displays a grid of tech stack logos with labels in a styled section.",
  "frontend/src/components/sections/WhatInovicsDoesSection.tsx": "Shows three feature cards describing control, clarity, and continuity with icons.",
  "frontend/src/components/shared/StandardBulletList.tsx": "Provides bullet list components with checkmark icons for consistent styled lists.",
  "frontend/src/components/TopNav.tsx": "Responsive navigation bar with hash‑based section scrolling, route changes, mobile sheet menu, and scroll‑aware styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state and refreshes dependent queries on change.",
  "frontend/src/hooks/useAdminInitializationStatus.ts": "Checks whether the admin is initialized using the actor and returns status and loading state.",
  "frontend/src/hooks/useAdminLeads.ts": "Fetches all leads for admin users via React Query using the backend actor with identity-based cache keys.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the current authenticated user is an admin and handles authorization errors gracefully.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Performs backend health checks using the actor’s healthCheck method and exposes status and retry helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useLeadSubmission.ts": "Submits lead data to the backend, manages loading and error states, and triggers health checks on failure.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced-motion preference using a media query listener.",
  "frontend/src/index.css": "Configures Tailwind layers, theme variables, dark‑mode styles, utilities, and reduced‑motion rules.",
  "frontend/src/lib/contactConfig.ts": "Defines external contact URLs and company contact details for use across the app.",
  "frontend/src/lib/strategyCall.ts": "Navigates to the strategy‑session page using client‑side routing and scrolls to top.",
  "frontend/src/lib/techStackLogos.ts": "Exports a list of tech‑stack logo metadata for homepage display.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page managing authentication, admin status, leads, and bootstrap token actions.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with hero, connection options, a scroll-targeted inquiry form, and qualification criteria. Includes hash-based scrolling logic and a detailed lead form section.",
  "frontend/src/pages/ControlFrameworkPage.tsx": "Displays the CONTROL framework overview with hero content, a scroll-to-form action, framework explanation, and multi-stage breakdown sections. Includes lead generation form anchor scrolling.",
  "frontend/src/pages/FaqPage.tsx": "Shows a hero section and an accordion-based FAQ list describing services, fit, process, and outcomes. Ends with a final call‑to‑action section.",
  "frontend/src/pages/IndustriesPage.tsx": "Presents industry-specific content blocks with case study modal support and a strategy‑call CTA. Includes consistency traits and a lead‑gen section.",
  "frontend/src/pages/insights/CanYourBusinessRunWithoutYouPage.tsx": "Renders the corresponding insight article using the shared layout and article metadata.",
  "frontend/src/pages/insights/components/InsightArticleLayout.tsx": "Provides the layout for insight articles, including SEO handling, back navigation, and structured content display.",
  "frontend/src/pages/insights/components/useInsightSeo.ts": "Custom hook that updates document title and meta description for insight pages with cleanup on unmount.",
  "frontend/src/pages/insights/CrmVsErpWhatGrowingSmesActuallyNeedPage.tsx": "Displays the CRM vs ERP insight article with a common article layout and dynamic section rendering.",
  "frontend/src/pages/insights/ExcelIsNotABusinessSystemPage.tsx": "Shows the Excel business-system insight article using the shared layout and section mapper.",
  "frontend/src/pages/insights/FromFounderDrivenToSystemDrivenPage.tsx": "Renders the founder-to-system-driven insight article through the shared article layout.",
  "frontend/src/pages/insights/insightArticles.ts": "Defines all insight article metadata, including titles, slugs, descriptions, and structured section content.",
  "frontend/src/pages/insights/insightSlugs.ts": "Exports stable slugs, titles, ordering, and helpers for validating and resolving insight article slugs.",
  "frontend/src/pages/insights/TheHiddenCostOfManualReportingPage.tsx": "Displays the manual reporting cost article using the reusable insight layout and content structure.",
  "frontend/src/pages/insights/WhyGrowthBreaksWeakInfrastructurePage.tsx": "Shows the growth vs weak infrastructure article with the unified layout and section mapping.",
  "frontend/src/pages/InsightsPage.tsx": "Renders the insights listing page with metadata updates, article grid navigation, and a newsletter signup form. Clicking an article updates history and scrolls to top.",
  "frontend/src/pages/ProcessPage.tsx": "Outlines the company’s transformation process with hero, philosophy, and detailed four‑stage breakdown sections. Includes bullet‑listed pain points and a strategy‑call CTA.",
  "frontend/src/pages/StrategySessionPage.tsx": "Page component showing a strategy session hero, eligibility sections, and a scroll-to-application-form action.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content scanning, extended theme colors, typography, animations, and utility plugins.",
  "project_state.json": "Defines project metadata, known issues, and feature requests focused on replacing homepage CONTROL framework images with improved versions."
}