{
  "backend/main.mo": "Motoko backend managing leads, user profiles, and admin authorization with CRUD-like functions and bootstrap-token-based admin initialization.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend files describing routing, components, sections, and styling updates.",
  "frontend/index.css": "Global Tailwind base and utility styles with OKLCH color variables and dark mode overrides.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, dark mode, and mounting the main React app.",
  "frontend/src/App.tsx": "Root React component handling client-side routing, page rendering, and insights article slug resolution.",
  "frontend/src/components/admin/AdminManagementCard.tsx": "Provides a form to grant admin privileges by validating a Principal ID and calling the backend actor method.",
  "frontend/src/components/admin/AdminTokenRestoreCard.tsx": "Allows submission of a bootstrap token to initialize the first admin, handling success and error states.",
  "frontend/src/components/contact/CompanyProfileDownloadDialog.tsx": "Displays a dialog collecting lead info for downloading the company profile and triggers a download after successful submission.",
  "frontend/src/components/contact/ContactOptionsGrid.tsx": "Renders a grid of contact options including booking calls, downloading the profile, emailing, and WhatsApp messaging.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright, attribution, and a caffeine.ai referral link.",
  "frontend/src/components/forms/ControlLeadGenForm.tsx": "Lead generation form collecting business details and challenges, submitting them via the lead submission hook.",
  "frontend/src/components/forms/FounderControlBlueprintInquiryForm.tsx": "Inquiry form for the Founder Control Blueprint, validating inputs and submitting detailed lead information.",
  "frontend/src/components/forms/IndustriesLeadGenForm.tsx": "A lead generation form collecting user, company, and industry details with validation and success handling.",
  "frontend/src/components/forms/InsightsNewsletterForm.tsx": "A newsletter signup form with email, company, and revenue validation plus success and reset states.",
  "frontend/src/components/forms/ProcessLeadGenForm.tsx": "A process-focused lead form capturing company challenges with validation, error states, and retry logic.",
  "frontend/src/components/forms/StrategySessionApplicationForm.tsx": "A strategy session application form collecting detailed business info and bottlenecks before submitting a lead.",
  "frontend/src/components/industries/CaseStudyCard.tsx": "A card component for viewing case study PDFs or details, supporting click actions and conditional buttons.",
  "frontend/src/components/industries/CaseStudyDetailsModal.tsx": "A modal displaying case study details with sectioned text or bullet lists and close controls.",
  "frontend/src/components/industries/industriesContent.ts": "Defines TypeScript interfaces and static content for industries, major services, and case studies.",
  "frontend/src/components/industries/IndustryBlock.tsx": "Renders an industry section with challenges, solutions, major services, and case studies, including click handling for case study details.",
  "frontend/src/components/industries/MajorServiceTile.tsx": "Displays a service tile with an image fallback and label for industry major services.",
  "frontend/src/components/ScrollToTopControl.tsx": "Floating scroll-to-top button that appears after scrolling 400px.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders the contact section with email, phone, address, and a button to book a strategy call.",
  "frontend/src/components/sections/ControlFrameworkSection.tsx": "Displays the CONTROL framework steps with images and navigation to the framework page.",
  "frontend/src/components/sections/EmotionalBlockSection.tsx": "A thematic section emphasizing founder dependency and business infrastructure messaging.",
  "frontend/src/components/sections/FinalCtaSection.tsx": "Final call-to-action section prompting users to book a strategy call.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with a background and embedded HeroSlider component.",
  "frontend/src/components/sections/HeroSlider.tsx": "Implements a multi-slide hero carousel with navigation, drag/swipe support, and CTA actions.",
  "frontend/src/components/sections/IndustriesSection.tsx": "Renders a grid of industry cards with icons, titles, and descriptions over a decorative background.",
  "frontend/src/components/sections/InsightsSection.tsx": "Displays the first three insight articles with navigation handlers and a button to view all insights.",
  "frontend/src/components/sections/OutcomesSection.tsx": "Shows key outcome bullet points and an accompanying dashboard visual for post‑Inovics transformation.",
  "frontend/src/components/sections/PageHero.tsx": "Reusable hero section with customizable title, subtitle, description, background image, and optional children.",
  "frontend/src/components/sections/ProblemSection.tsx": "Lists common business problems using icon cards and ends with a strong systems‑focused message.",
  "frontend/src/components/sections/ProcessSection.tsx": "Accordion-based four‑step process explaining diagnosis, architecture, implementation, and optimization phases.",
  "frontend/src/components/sections/TechStackSection.tsx": "Renders a grid of tech stack logos with labels under a section header.",
  "frontend/src/components/sections/WhatInovicsDoesSection.tsx": "Displays three feature cards—Control, Clarity, Continuity—describing Inovics' core value proposition.",
  "frontend/src/components/shared/StandardBulletList.tsx": "Provides reusable bullet list components using checkmark icons for consistent styling.",
  "frontend/src/components/TopNav.tsx": "Top navigation bar with scroll-based styling, hash-section scrolling, client-side routing, and mobile sheet menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminInitializationStatus.ts": "Checks whether admin initialization is complete by querying the backend actor, scoped per principal.",
  "frontend/src/hooks/useAdminLeads.ts": "Fetches all leads for admin users using react-query with identity-specific cache keys and connection retry logic.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks if the current identity is an admin via actor.isCallerAdmin with error handling and refetch support.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Runs backend health checks through actor.healthCheck and exposes status, message, and manual refetch.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, including identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useLeadSubmission.ts": "Submits lead data through the backend actor with health checks, loading state, errors, and retry handling.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's prefers-reduced-motion setting and updates on system preference changes.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, utility classes, and reduced-motion behavior.",
  "frontend/src/lib/contactConfig.ts": "Exports contact-related URLs and company info for use across the app.",
  "frontend/src/lib/strategyCall.ts": "Navigates the user to the strategy-session page with smooth scrolling.",
  "frontend/src/lib/techStackLogos.ts": "Provides configuration for tech stack logos including labels, image paths, and alt text.",
  "frontend/src/main.tsx": "Initializes React root with QueryClientProvider and InternetIdentityProvider wrapping the app.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard handling authentication, admin checks, lead fetching, and bootstrap token generation UI.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with a hero, contact options, inquiry form, and qualification details, including hash‑based scrolling on load.",
  "frontend/src/pages/ControlFrameworkPage.tsx": "Displays the CONTROL framework with a hero, descriptions, staged methodology, and a scroll-to-form CTA.",
  "frontend/src/pages/FaqPage.tsx": "Shows a hero and an accordion of FAQs with structured question–answer lists and a final call-to-action.",
  "frontend/src/pages/IndustriesPage.tsx": "Provides industry-specific sections, case study modal handling, and a lead-gen flow framed by a hero and consistency summary.",
  "frontend/src/pages/insights/CanYourBusinessRunWithoutYouPage.tsx": "Displays the article for the 'Can Your Business Run Without You?' insight using shared layout and section rendering.",
  "frontend/src/pages/insights/components/InsightArticleLayout.tsx": "Provides the shared layout for insight articles, including SEO updates, back navigation, and styled content container.",
  "frontend/src/pages/insights/components/useInsightSeo.ts": "Custom hook that manages document title and meta description updates for insight pages with cleanup on unmount.",
  "frontend/src/pages/insights/CrmVsErpWhatGrowingSmesActuallyNeedPage.tsx": "Renders the CRM vs ERP insight article using the generic InsightArticleLayout and mapped article sections.",
  "frontend/src/pages/insights/ExcelIsNotABusinessSystemPage.tsx": "Shows the 'Excel Is Not a Business System' article with structured sections inside the common article layout.",
  "frontend/src/pages/insights/FromFounderDrivenToSystemDrivenPage.tsx": "Renders the 'From Founder-Driven to System-Driven' insight article through the shared article layout.",
  "frontend/src/pages/insights/insightArticles.ts": "Defines article metadata and content for all insight articles, keyed by slug.",
  "frontend/src/pages/insights/insightSlugs.ts": "Defines stable slugs, titles, ordering, and helper functions for insight article identification and lookup.",
  "frontend/src/pages/insights/TheHiddenCostOfManualReportingPage.tsx": "Displays the 'Hidden Cost of Manual Reporting' insight article using the reusable layout and section mapping.",
  "frontend/src/pages/insights/WhyGrowthBreaksWeakInfrastructurePage.tsx": "Renders the 'Why Growth Breaks Weak Infrastructure' article with standard layout and dynamically mapped sections.",
  "frontend/src/pages/InsightsPage.tsx": "Renders the Insights hub with metadata setup, article grid navigation, and a newsletter signup section.",
  "frontend/src/pages/ProcessPage.tsx": "Outlines the company’s transformation philosophy and 4‑stage process with a hero, structured sections, and lead-gen CTA.",
  "frontend/src/pages/StrategySessionPage.tsx": "Renders the Strategy Session landing page with hero content, target-audience sections, and a scroll-to-form action. Includes form focus logic and styled UI components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, typography, container queries, animations, and extended theme settings for the frontend.",
  "project_state.json": "Defines the project state and pending feature requests, mainly focused on generating and storing an INOVICS-themed PPTX presentation within the project files."
}