{
  "kind": "build_request",
  "title": "Generate and add the INOVICS presentation deck (.pptx) to the project files",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Generate the complete INOVICS corporate presentation deck as a PowerPoint (.pptx) and add the resulting file to the repository so it is available from the project’s Files panel (no external links). The deck must follow the project styling notes: dark navy background (similar to #0D1B2A), yellow accent (in the #FFC300 range), clean enterprise look, bold typography, minimal bullet points, abstract data/grid visuals, and no stock/cheesy imagery or heavy icons. Use the exact slide-by-slide content previously provided in the conversation and keep the deck length within 12–14 slides (target 14).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Create the pptx file in the project\n\nand I’ll place the full deck there for you to download."
        ]
      },
      "acceptanceCriteria": [
        "A .pptx file for the INOVICS deck exists in the project repository (committed as a binary asset) and is visible/downloadable from the Files panel.",
        "The PPTX opens successfully in PowerPoint/Google Slides without layout breakage or missing fonts/assets.",
        "The deck contains 12–14 slides (target 14) and uses the exact slide-by-slide content from the prior conversation.",
        "Visual style matches the specified dark navy + yellow accent theme, with bold headings, minimal bullets, and abstract data/grid visuals; no stock/cheesy imagery or heavy iconography is used."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or any path listed in frontend.immutablePaths.",
    "Do not introduce external services, APIs, or databases to generate or store the PPTX."
  ],
  "nonGoals": [
    "Adding a new in-app UI button/link to download the PPTX from the running website (not requested in the latest user message).",
    "Implementing backend storage or serving logic for the PPTX."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}