{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Hide Strategy Session nav item and route all Book Strategy Call CTAs to /strategy-session",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the standalone \"Strategy Session\" link from top navigation (desktop and mobile) while keeping all other navigation intact.",
      "acceptanceCriteria": [
        "Top navigation (desktop and mobile) no longer displays a link labeled \"Strategy Session\" that routes to \"/strategy-session\".",
        "All other existing nav links continue to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Remove the \"Strategy Session\" entry from the navLinks array so it no longer renders in desktop/mobile navigation while preserving existing hash/route navigation behavior for all remaining links."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the shared \"Book Strategy Call\" click handler to navigate internally to \"/strategy-session\" using the app’s existing pushState + popstate routing and scroll to top behavior.",
      "acceptanceCriteria": [
        "Clicking \"Book Strategy Call\" in the TopNav (desktop and mobile) navigates to \"/strategy-session\" and renders the StrategySessionPage without a full page reload.",
        "Clicking other CTAs that use the shared booking handler (e.g., \"Book Call\" in ContactOptionsGrid and CTAs in homepage sections) also navigates to \"/strategy-session\" from any current route.",
        "After navigation to \"/strategy-session\", the page is scrolled to the top (consistent with other route navigations in the app)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/strategyCall.ts",
          "operation": "modify",
          "description": "Change bookStrategyCall() to perform in-app navigation to \"/strategy-session\" via window.history.pushState followed by dispatching a PopStateEvent(\"popstate\"), then scroll to the top to match the app’s client-side routing pattern (no full page reload)."
        }
      ]
    }
  ]
}