{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dedicated CONTROL™ Framework page with homepage + menu navigation and lead-gen form",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a new standalone CONTROL™ Framework page with the exact user-provided sections/copy and CTAs that trigger the existing strategy-call/contact action.",
      "acceptanceCriteria": [
        "A new navigable page exists for the CONTROL™ Framework (not just an anchor section on the homepage).",
        "All headings, subheadings, bullet lists, and CTAs match the user-provided English copy (including ™ symbols and currency formatting like ₹5–50 Cr).",
        "The CONTROL™ page includes all requested sections in the same order as provided.",
        "Both CTAs labeled “Book a Founder Strategy Call” on the CONTROL™ page navigate the user to the site’s strategy-call/contact action (consistent with existing behavior, e.g., scroll to contact or open the existing mailto flow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ControlFrameworkPage.tsx",
          "operation": "create",
          "description": "Create the standalone “The CONTROL™ Framework” page component and implement the exact section order and exact English copy from the user (Hero, Sections 1–5 with mid-page form, Final Section). Use shadcn-ui composed components (e.g., Button/Card/Input/Select/Textarea) for layout and form controls; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/strategyCall.ts",
          "operation": "create",
          "description": "Add a small shared helper to trigger the existing strategy-call/contact action in a consistent way (match current behavior from ContactSection, e.g., mailto flow). This will be used by both “Book a Founder Strategy Call” CTAs on the CONTROL™ page and can be reused elsewhere."
        },
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Refactor to use the shared strategy-call/contact helper for its CTA action so the CONTROL™ page and existing contact CTA remain behaviorally consistent."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new CONTROL™ Framework page into the app as a standalone view by conditionally rendering either the existing single-page homepage sections or the new ControlFrameworkPage based on the current browser path (no changes to frontend/src/main.tsx). Ensure the new page is reachable via navigation changes in other requirements."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a visible homepage “Read more” link/button that navigates to the standalone CONTROL™ Framework page.",
      "acceptanceCriteria": [
        "Homepage renders a visible “Read more” (or equivalent) link/button related to the CONTROL™ Framework.",
        "Clicking the “Read more” link navigates to the new CONTROL™ Framework page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ControlFrameworkSection.tsx",
          "operation": "modify",
          "description": "Add a visible “Read more” (or equivalent) Button/link on the homepage CONTROL™ section that navigates to the standalone CONTROL™ Framework page path. Use shadcn-ui Button (composed only; do not modify frontend/src/components/ui); verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a main-menu entry for the CONTROL™ Framework page while preserving existing homepage scroll-spy and smooth-scroll behavior for other items.",
      "acceptanceCriteria": [
        "Top navigation includes a menu item for the CONTROL™ Framework page.",
        "The CONTROL™ menu item navigates to the CONTROL™ Framework page on both desktop and mobile menu.",
        "Existing scroll-spy + smooth-scroll behavior for current homepage section links remains functional on the homepage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Add a new nav link for the CONTROL™ Framework page (route-style, not a hash). Update click handling so hash links keep smooth-scroll and scroll-spy behavior on the homepage, while the CONTROL™ menu item performs normal navigation to the standalone page on both desktop and mobile sheet menus. Use existing shadcn-ui Button/Sheet components as composed; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure any new navigation path introduced for the CONTROL™ menu item is recognized by the App’s conditional rendering so navigation to/from the standalone page works without breaking homepage behavior."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement the CONTROL™ Framework lead-generation form UI with exact fields/options, button copy, helper text, and basic client-side validation.",
      "acceptanceCriteria": [
        "All specified fields are present with appropriate input types (dropdowns for Industry and Annual Revenue Range; textarea for Biggest Operational Challenge).",
        "Annual Revenue Range dropdown options exactly match: “₹5–10 Cr”, “₹10–25 Cr”, “₹25–50 Cr”, “50+ Cr”.",
        "The submit button label is exactly “Request Blueprint Review”.",
        "The small text “We work with a limited number of businesses each quarter.” appears below the submit button.",
        "Basic client-side validation prevents submission when required fields are empty and validates email format for Work Email."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/forms/ControlLeadGenForm.tsx",
          "operation": "create",
          "description": "Create the lead-gen form component with the exact fields: First Name, Last Name, Company Name, Industry (dropdown), Annual Revenue Range (dropdown with exact ₹ options), Biggest Operational Challenge (textarea), Work Email, Mobile Number; submit button text “Request Blueprint Review”; and the exact small text below the button. Implement basic client-side required-field checks and Work Email format validation. Use shadcn-ui composed components (Input, Select, Textarea, Button, etc.); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ControlFrameworkPage.tsx",
          "operation": "modify",
          "description": "Position the ControlLeadGenForm mid-page within Section 5 per the provided page structure, ensuring surrounding copy/CTAs match the user-provided English text exactly (including ™)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Submit the lead-gen form via existing backend actor capability, capture submissions, and show a clear inline success state without unexpected navigation.",
      "acceptanceCriteria": [
        "Form submission triggers a single, user-visible success confirmation (e.g., inline success message) and clears or preserves fields in a consistent, intentional way.",
        "Backend exposes an endpoint to accept and persist lead submissions (anonymous users allowed).",
        "A submitted lead includes all form fields plus a server timestamp.",
        "No runtime errors occur when submitting the form from the CONTROL™ Framework page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLeadSubmission.ts",
          "operation": "create",
          "description": "Create a small hook that uses the existing useActor() to submit leads using the available backendInterface capability. Map the richer form data into the backend’s supported parameters (e.g., include additional fields in the message payload) while preserving email/first/last name, and expose loading/success/error state to the form."
        },
        {
          "path": "frontend/src/components/forms/ControlLeadGenForm.tsx",
          "operation": "modify",
          "description": "Wire the form submit handler to useLeadSubmission(), disable repeated submissions while in-flight, and render a clear inline success confirmation without navigating away. Ensure consistent post-submit behavior (clear or preserve inputs intentionally) and handle error display safely."
        }
      ]
    }
  ]
}